<a href="https://colab.research.google.com/github/brayan-mesquita/pandas/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CONCEITOS INICIAIS

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

## Objetivos
- importar dados
    - csv, excel, sql
- analise iniciais
    - tamanho
    - nomes de colunas
    - describe
- definir-excluir index
- renomear colunas
- excluir colunas
- limpeza de dados
- splitando informações
    - loc
    - iloc
- operacoes matematicas entre dados
    - soma
    - subtracao
    - media
    - divisao

## data frame e series

### data frame
entende-se com uma planilha de linhas e colunas

In [13]:
dicionario = {'nome':['brayan', 'miguel'], 'idade':[30, 5], 'ultimo_nome':['mesquita', 'nogueira']}
df = pd.DataFrame(dicionario)
df

     nome  idade ultimo_nome
0  brayan     30    mesquita
1  miguel      5    nogueira

### series
entende-se, superficialmente, com uma unica coluna;
um array de dados

In [16]:
np_array = np.array([3, 4, 5, 2, 4, 6, 7])
lista = [3, 4, 65, 2, 4, 5, 6]
tupla = (34, 5, 6, (34, 4))
#----------------------
se1 = pd.Series(np_array)
se2 = pd.Series(lista)
se3 = pd.Series(tupla)
se3#tupla com tuplas dentro

0         34
1          5
2          6
3    (34, 4)
dtype: object

# DADOS

## Importando dados

In [2]:
#pd.read_excel('')
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

## visao inicial dos dados

In [4]:
df.shape#verificando tamanho do dataset

(891, 12)

In [16]:
df.head(3)#primeiras linhas

,id,sobrevivente,classe,nome,sexo,idade,SibSp,Parch,Ticket,Fare,cabine,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
df.tail(2)#ultimas linhhas

,id,sobrevivente,classe,nome,sexo,idade,SibSp,Parch,Ticket,Fare,cabine,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [17]:
df.shape#verificao de linhas e colunas

(891, 12)

In [12]:
df.describe()

,id,sobrevivente,classe,idade,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## tipos de dados

In [ ]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## colunas

### renomeando colunas

In [5]:
#renomeando colunas 1 forma
df.columns = ['id', 'sobrevivente', 'classe', 'nome', 'sexo', 'idade', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'cabine', 'Embarked']

In [8]:
#renomeando colunas 2 forma
df.rename(columns = {"Ticket":"bilhete"}, inplace=True)
df.columns

Index(['id', 'sobrevivente', 'classe', 'nome', 'sexo', 'idade', 'SibSp',
       'Parch', 'bilhete', 'Fare', 'cabine', 'Embarked'],
      dtype='object')

In [10]:
df.head()

,id,sobrevivente,classe,nome,sexo,idade,SibSp,Parch,bilhete,Fare,cabine,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
df[['idade', 'sexo', 'bilhete']].head(2)

   idade    sexo    bilhete
0   22.0    male  A/5 21171
1   38.0  female   PC 17599

### filtragem por coluna

In [63]:
df['idade'].head()#apresentada desta forma gera uma series

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: idade, dtype: float64

In [64]:
#lista de colunas
df[['idade', 'nome']].head()#apresenta-se como dataframe

   idade                                               nome
0   22.0                            Braund, Mr. Owen Harris
1   38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2   26.0                             Heikkinen, Miss. Laina
3   35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4   35.0                           Allen, Mr. William Henry

In [12]:
se_man = df['sexo'] == 'male'#retorna uma series
df_man = df[df['sexo'] == 'male']#retorna um dataframe
print(type(se_man))
print(type(df_man))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

## loc

In [31]:
#df['Name']
#df[0:2]
#df.loc[:, ['Name', 'Sex', 'Pclass']]
df2 = df.loc[100:105, ['nome', 'sexo', 'classe']]
df2.head()

                                 nome    sexo  classe
100           Petranec, Miss. Matilda  female       3
101  Petroff, Mr. Pastcho ("Pentcho")    male       3
102         White, Mr. Richard Frasar    male       1
103        Johansson, Mr. Gustaf Joel    male       3
104    Gustafsson, Mr. Anders Vilhelm    male       3

In [48]:
df.loc[df['idade'] == 20].head(2)

,id,sobrevivente,classe,nome,sexo,idade,SibSp,Parch,Ticket,Fare,cabine,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.0,0,0,347466,7.8542,NaN,S

In [73]:
df[['idade', 'sexo', 'classe']].loc[df['idade'] < 5].head(3)

    idade    sexo  classe
7     2.0    male       3
10    4.0  female       3
16    2.0    male       3

## Iloc

In [ ]:
#df.iloc[0]
#df.iloc[3:5, 0:5]
df.iloc[[4, 5, 6, 7, 78], [3, 4]]#relacao linha / coluna

                              Name   Sex
4         Allen, Mr. William Henry  male
5                 Moran, Mr. James  male
6          McCarthy, Mr. Timothy J  male
7   Palsson, Master. Gosta Leonard  male
78   Caldwell, Master. Alden Gates  male

In [ ]:
#df.iloc[:, 1:3]
df.iloc[1:2, [3, 4]]

                                                Name     Sex
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female

In [ ]:
#loc para linha e coluna
df.loc[..., ['nome','sexo','idade']]

                                                  nome    sexo  idade
0                              Braund, Mr. Owen Harris    male   22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38.0
2                               Heikkinen, Miss. Laina  female   26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35.0
4                             Allen, Mr. William Henry    male   35.0
..                                                 ...     ...    ...
886                              Montvila, Rev. Juozas    male   27.0
887                       Graham, Miss. Margaret Edith  female   19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female    NaN
889                              Behr, Mr. Karl Howell    male   26.0
890                                Dooley, Mr. Patrick    male   32.0

[891 rows x 3 columns]